<a href="https://colab.research.google.com/github/zerostone-kim/pandas/blob/master/Pandas_sample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- Pasdas import

In [0]:
# pandas 사용하기
import numpy as np # numpy 도 함께 import
import pandas as pd

In [2]:
# Series 정의하기
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
# Series의 값만 확인하기
obj.values

array([ 4,  7, -5,  3])

In [4]:
# 인덱스를 바꿀 수 있다.
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

d    4
b    7
a   -5
c    3
dtype: int64

In [5]:
# python의 dictionary 자료형을 Series data로 만들 수 있다.
# dictionary의 key가 Series의 index가 된다
sdata = {'Kim': 35000, 'Beomwoo': 67000, 'Joan': 12000, 'Choi': 4000}
obj3 = pd.Series(sdata)
obj3


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
dtype: int64

In [6]:
obj3.name = 'Salary'
obj3.index.name = "Names"
obj3


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

Names
Kim        35000
Beomwoo    67000
Joan       12000
Choi        4000
Name: Salary, dtype: int64

In [7]:
# Data Frame 정의하기
# 이전에 DataFrame에 들어갈 데이터를 정의해주어야 하는데,
# 이는 python의 dictionary 또는 numpy의 array로 정의할 수 있다.
data = {'name': ['Beomwoo', 'Beomwoo', 'Beomwoo', 'Kim', 'Park'],
        'year': [2013, 2014, 2015, 2016, 2015],
        'points': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

      name  year  points
0  Beomwoo  2013     1.5
1  Beomwoo  2014     1.7
2  Beomwoo  2015     3.6
3      Kim  2016     2.4
4     Park  2015     2.9

In [10]:
# 행 방향의 index
df.index

# 열 방향의 index
df.columns

# 값 얻기
df.values

# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

RangeIndex(start=0, stop=5, step=1)

In [11]:
# 각 인덱스에 대한 이름 설정하기
df.index.name = 'Num'
df.columns.name = 'Info'
df


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

Info     name  year  points
Num
0     Beomwoo  2013     1.5
1     Beomwoo  2014     1.7
2     Beomwoo  2015     3.6
3         Kim  2016     2.4
4        Park  2015     2.9

In [12]:
# DataFrame을 만들면서 columns와 index를 설정할 수 있다.
df2 = pd.DataFrame(data, columns=['year', 'name', 'points', 'penalty'],
                  index=['one', 'two', 'three', 'four', 'five'])
df2


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

       year     name  points penalty
one    2013  Beomwoo     1.5     NaN
two    2014  Beomwoo     1.7     NaN
three  2015  Beomwoo     3.6     NaN
four   2016      Kim     2.4     NaN
five   2015     Park     2.9     NaN

In [13]:
# describe() 함수는 DataFrame의 계산 가능한 값들에 대한 다양한 계산 값을 보여준다.
df2.describe()


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

              year    points
count     5.000000  5.000000
mean   2014.600000  2.420000
std       1.140175  0.864292
min    2013.000000  1.500000
25%    2014.000000  1.700000
50%    2015.000000  2.400000
75%    2015.000000  2.900000
max    2016.000000  3.600000

In [14]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])
df


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [16]:
# 3-1. DataFrame에서 열을 선택하고 조작하기

df['year']


# 출처: https://doorbw.tistory.com/172 [Tigercow.Door]

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [17]:
# 동일한 의미를 갖는, 다른 방법
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [18]:
df[['year','points']]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9